<a href="https://colab.research.google.com/github/weepingwillow2001/data_analysis_practice/blob/main/7%EC%9E%A5/7_2_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
# 샘플 Series 생성
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [4]:
# -999를 NaN으로 치환
data.replace(-999, np.nan)
# 결과: -999값이 NaN으로 변경된 Series

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [5]:
# 여러 값을 한번에 치환
data.replace([-999, -1000], np.nan)
# 결과: -999와 -1000 모두 NaN으로 변경된 Series

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [6]:
# "값마다" 다른 값으로 치환: "딕셔너리" 처럼
data.replace({-999: np.nan, -1000: 0})
# 결과: -999는 NaN으로, -1000은 0으로 변경된 Series

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [7]:
# 다른 문법으로 동일한 결과
data.replace([-999, -1000], [np.nan, 0])
# 결과: -999는 NaN으로, -1000은 0으로 변경된 Series

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64